Repository: 84000/data-translation-memory
Catalog: toh116-v1.tmx
Source language: bo
Languages: en

source: ཤིང་ཙུ་ཏ་ཀ་ཡང་འཕེལ་བར་འགྱུར། ཤིང་ཀུན་དའི་མེ་ཏོག་ཀྱང་འབྱུང་བར་འགྱུར། ཤིང་ཙམ་པ་ཀ་ཡང་འཕྱོང་བར་འགྱུར། རྫིང་བུ་མེ་ཏོག་གིས་ཤིན་ཏུ་གང་བ་ཡང་འབྱུང་བར་འགྱུར། དེ་ལས་རིན་པོ་ཆེའི་ཤིང་རྣམས་ཀྱང་འབྱུང་བར་འགྱུར།
en: a profusion of mango trees appears, star jasmine flowers and magnolia trees appear, ponds covered with flowers appear, and precious trees appear.

source: ཆར་སྣ་ཚོགས་ཀྱང་འབབ་པར་འགྱུར་ཏེ། ནོར་བུ་དང་། མུ་ཏིག་དང་། རྡོའི་སྙིང་པོ་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་རིན་པོ་ཆེའི་ཆར་ཡང་འབབ། ལྷའི་གོས་ཀྱི་ཆར་ཡང་འབབ་པར་འགྱུར་རོ།
en: There is a rain of various flowers, a rain of precious stones—jewels, pearls, diamonds, beryl, conch, crystal, and coral—and there is a rain of divine cloth.

source: འཁོར་ལོ་རིན་པོ་ཆེ་དང་། བལ་གླང་རིན་པོ་ཆེ་དང་། རྟ་རིན་པོ་ཆེ་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། བུད་མེད་རིན་པོ་ཆེ་དང་། ཁྱིམ་བདག་རིན་པོ་ཆེ་དང་། བློན་པོ་རིན་པོ་ཆེ་བདུན་རྣམས་སོ། །
en: the precious wheel, the precious horse, the precious elephant, the precious jewel, the precious wife, the precious householder, and the precious counselor

source: ས་གསེར་དུ་སྣང་ངོ་། །
en: the ground appears to be made of gold.

source: གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་འཇིག་རྟེན་གྱི་ཁམས་བདེ་བ་ཅན་ནས་བྱུང་བ་དེའི་ཚེ། ས་རྣམ་པ་དྲུག་ཏུ་རབ་ཏུ་གཡོས་སོ།
en: When Bodhisattva Mahāsattva Avalokiteśvara comes from the realm of Sukhāvatī, the entire world shakes six times.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེས། འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Then Bodhisattva Ratnapāṇi asked Bhagavat Śikhin,

source: བཅོམ་ལྡན་འདས་གང་གི་ལྟས་ལགས།
en: ‘Bhagavat, what are these omens of?’

source: རིགས་ཀྱི་བུ། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དེ་འོངས་ཏེ།
en: ‘Noble son, Bodhisattva Mahāsattva Avalokiteśvara is arriving,

source: དེའི་ལྟས་འདི་འདྲ་བ་དག་བྱུང་ངོ་། །
en: and that is why these omens appear.’

source: གང་གི་ཚེ་ན་བསྐྱོད་པ་དེའི་ཚེ། ཡིད་དགའ་བའི་མེ་ཏོག་པད་མའི་ཆར་རབ་ཏུ་བབ་སྟེ།
en: “As the earth shook and it rained beautiful lotuses,

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་མེ་ཏོག་པད་མ་འདབ་མ་སྟོང་པ་སྡོང་བུ་གསེར་དུ་སྣང་བ་ཐོགས་ནས་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། །
en: Bodhisattva Mahāsattva Avalokiteśvara came to Bhagavat Śikhin. He was holding lotus flowers, each with a thousand petals and a golden stem.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་མེ་ཏོག་འདི་དག་དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་ཀྱིས་བསྐུར་ཏོ་ཞེས་པད་མ་ཕུལ་ཏེ་བསྙུང་བ་མ་མཆིས་སམ། འོ་མ་བརྒྱལ་ཏམ། བཞེངས་པ་ཡང་ངམ། བདེ་བ་ལ་རེག་པར་གནས་སམ་ཞེས་ཀྱང་གསུང་ངོ་། །
en: He bowed down his head to the bhagavat’s feet and offered the lotuses to him. He said, ‘Tathāgata Amitābha sends these flowers to you. The Tathagāta asks if you are in health, if you are at ease, and if all is well.’

source: དེས་པད་མ་དེ་བླངས་ཏེ་གཡོན་ཕྱོགས་སུ་བཞག་ནས། །
en: “Bhagavat Śikhin took the lotuses and placed them on his left.

source: དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་རྗོད་པ་མཛད་དོ། །
en: He then spoke of the qualities of Bodhisattva Mahāsattva Avalokiteśvara.

source: སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ལས་ཀྱིས་ཇི་ལྟ་བུར་བསྒྲུབས་པ་ཡིན།
en: ‘How did you, Avalokiteśvara, accomplish your task

source: སེམས་ཅན་ཡི་དགས་དག་དང་། བསྟིར་མེད་པར་སྐྱེས་པ་དག་དང་། ཐིག་ནག་པོ་ཅན་དག་དང་། འོ་དོད་འབོད་པ་དག་དང་། ཧ་ཧ་ཞེས་འབོད་པ་ཐམས་ཅད་དག་དང་། གདུང་བའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དང་། སྡོང་དུམ་ལྟ་བུའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དང་། མེའི་བུམ་པའི་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཤམ་བ་ལ་དང་། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་ཆུ་གྲང་བ་དང་།
en: among the pretas, the beings in the Avīci hell, the beings in Kālasūtra and Raurava, the beings in Hāhava, Tāpana, the great hell Pretāyana, the great hell Agnighaṭa, the great hell Śālmali, the great hell Śītodaka, and others?’

source: སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་དེ་དག་ཏུ་སེམས་ཅན་གང་དག་སྐྱེས་པ་དག་ནི་བདག་གི་ལས་ཀྱི་ས་སྟེ།
en: ‘The beings in those great hells are my task.

source: བདག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱིའོ། །
en: I will completely ripen those beings,

source: བགྱིས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་དགོད་པར་བགྱིའོ།
en: and then I will bring them to the highest complete enlightenment.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོས་དྲིས་པའི་ལན་བཏབ་ནས།
en: “Bodhisattva Mahāsattva Avalokiteśvara, having given this answer,

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་ཕྱོགས་གཅིག་ཏུ་སོང་ངོ་། །
en: bowed his head to the bhagavat’s feet, departed alone,

source: སོང་ནས་མེའི་ཕུང་པོ་འབར་བ་བཞིན་དུ་ས་དང་ནམ་མཁའ་ལ་མི་སྣང་བར་སོང་ངོ་།
en: and disappeared into the sky as a blazing mass of fire.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: “Then Bodhisattva Ratnapāṇi asked Bhagavat Śikhin,

source: བཅོམ་ལྡན་འདས་ཞུ་བ་ལུང་བསྟན་པ་བཤད་པ་བདག་ཞུ་ན།
en: ‘Bhagavat, if I may ask for an answer to a question,

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ཇི་ལྟ་བུ་ལགས། །
en: how much merit has Bodhisattva Mahāsattva Avalokiteśvara accumulated?’

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལ་ལྷའི་བསྐལ་པར་ན་བཟའ་དང་། བཤོས་དང་། མལ་སྟན་དང་། ན་བའི་རྐྱེན་གྱི་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས། །
en: ‘If someone were for a deva’s eon to serve tathāgatas, arhats, and samyaksaṃbuddhas as numerous as the grains of sand in the Ganges with robes, food, bowls, bedding, seats, necessary medicine, and utensils,

source: གང་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལས་བསོད་ནམས་འཕེལ་བར་གྱུར་པའི་བསོད་ནམས་དེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བ་སྤུ་གཅིག་གི་རྩེ་ལ་གནས་པའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་མཉམ་མོ།
en: the merit that would be produced through those tathāgatas would be the same as that of the tip of one hair on the body of Bodhisattva Mahāsattva Avalokiteśvara.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་གླིང་ཆེན་པོ་བཞིར་ཟླ་བ་བཅུ་གཉིས་ཀྱི་ལོར་ཉིན་མཚན་དུ་ཆར་པ་བབ་ཀྱང་ཐིགས་པ་རེ་རེ་ནས་བགྲང་ནུས་ཀྱི། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་ངས་བགྲང་བར་མི་ནུས་སོ།
en: ‘Noble son, it is like this. As a comparison, if it were to rain day and night on the four great continents for a twelve-month year, I could count each drop, but, noble son, I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་ངས་བགྲང་བར་མི་ནུས་སོ།
en: but, noble son, I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་རྒྱ་མཚོ་མཆིང་རྣམ་ཆེན་པོ་ཟབས་སུ་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་ཡོད་ལ།
en: “ ‘Noble son, it is like this. As a comparison, the ocean is 84,000 yojanas deep

source: ཞེང་དུ་དཔག་ཏུ་མེད་ལ། རྟ་རྒོད་མའི་ཁ་ལྟ་བུའི་མཐར་ཐུག་པའི་ཐིགས་པ་རེ་རེ་ནས་ངས་བགྲང་ནུས་ཀྱི། །
en: and has an immeasurable expanse, but I can count each drop all the way down to Vaḍavāmukha.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གླིང་ཆེན་པོ་བཞི་ན་སེང་གེ་དང་། སྟག་དང་། དྲེད་དང་། ཏ་རཀྵ དང་། རི་དགས་ལ་སོགས་པ་དང་། བ་ལང་དང་། བོང་བུ་དང་། ཕྱུགས་དང་། བལ་གླང་དང་། རྟ་དང་། མ་ཧེ་དང་། བྱི་ལ་ལ་སོགས་པ་རྐང་པ་བཞི་པ་དེ་དག་གི་སྤུ་རེ་རེ་ནས་ནི་ངས་བགྲང་ནུས་ཀྱི། །
en: “ ‘Noble son, it is like this. As a comparison, I can count every hair on all the four-legged creatures in the four great continents, such as lions, tigers, bears, hyenas, deer, camels, jackals, and so on, and oxen, donkeys, cattle, elephants, horses, buffalo, and cats,

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། རྡུལ་ཕྲ་རབ་ཀྱི་རྡུལ་སྙེད་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སྐུ་གཟུགས་ལྷའི་གསེར་རིན་པོ་ཆེ་ལས་བྱས་ནས་ཉིན་གཅིག་བཞིན་དུ་རིང་བསྲེལ་བཅུག་ན། །
en: “ ‘Noble son, it is like this. As a comparison, if stūpas for tathāgatas, arhats, and samyaksaṃbuddhas as numerous as atoms were made in divine gold and precious stones, and in one day the relics were placed in them all,

source: རིགས་ཀྱི་བུ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་ངས་བགྲང་ནུས་ཀྱི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་ངས་བགྲང་བར་མི་ནུས་སོ།
en: I can calculate the accumulation of that merit, but I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཚོགས་ནི་ངས་བགྲང་བར་མི་ནུས་སོ། །
en: I cannot calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། ཤིང་ཤྲི་ཤ་པའི་ཚལ་གྱི་ལོ་མ་ནི་ངས་བགྲང་ནུས་ཀྱི།
en: “ ‘Noble son, it is like this. As a comparison, I can count the number of leaves in a forest of agarwood trees, but

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། གླིང་ཆེན་པོ་བཞི་ན་གནས་པའི་བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་གནས་པ་དེ་དག་ཐམས་ཅད་
en: “ ‘Noble son, it is like this. As a comparison, if all the women, men, boys, and girls in the four great continents

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་བཀོད་ན།
en: were to gain the result of becoming stream entrants, once-returners, non-returners, arhats, and pratyekabuddhas,

source: གང་དེ་དག་གི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ནི་སྔ་མ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བ་སྤུའི་རྩེ་མོའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་དང་མཉམ་མོ།
en: their merit would only be, as said before, equal to the merit of the tip of one hair on the body of Bodhisattva Mahāsattva Avalokiteśvara.’

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཅི་འདྲ་བ་དེ་ལྟ་བུ་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་གང་ལ་ཡང་མ་མཐོང་མ་ཐོས་ན་བྱང་ཆུབ་སེམས་དཔར་གྱུར་པ་ལྟ་ཅི་སྨོས།
en: ‘Bhagavat, I have never seen nor heard of tathāgatas having the kind of accumulation of merit that Bodhisattva Mahāsattva Avalokiteśvara has, let alone bodhisattvas.’

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་གང་ང་འདྲ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སུ་གྱུར་ལ། དེ་དག་ཀྱང་
en: ‘Noble son, even if all who are tathāgatas, arhats, and samyaksaṃbuddhas like me

source: གནས་གཅིག་ཏུ་གཞོག་ཅིང་ན་བཟའ་དང་། བཤོས་དང་། མལ་སྟན་དང་། ན་བའི་རྐྱེན་གྱི་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་བསྐལ་པར་གཞོག་ཀྱང་
en: were gathered in one place and provided for an eon with robes, food, bowls, bedding, seats, necessary medicine, and utensils,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་བགྲང་མི་ནུས་ན།
en: those tathāgatas, arhats, and samyaksaṃbuddhas would still not be able to calculate Bodhisattva Mahāsattva Avalokiteśvara’s accumulation of merit.

source: རིགས་ཀྱི་བུ་ང་གཅིག་པུ་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་གནས་པས་ལྟ་ཅི་སྨོས།
en: So, noble son, it is needless to say that I cannot do so all by myself in this world.

source: གང་འཇིག་རྟེན་ན། བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མིང་དྲན་པ་དེ་དག་ནི། བདེ་བ་དང་ལྡན་པ་ཡིན་ནོ།
en: “‘Those who remember Bodhisattva Mahāsattva Avalokiteśvara’s name will have happiness in this world.

source: དེ་དག་ནི་རྒ་བ་དང་། འཆི་བ་དང་། ན་བ་དང་། སྡུག་བསྔལ་བ་ལས་ཡོངས་སུ་ཐར་བ་ཡིན་ནོ། །
en: They will be completely freed from the sufferings of aging, death, and illness.

source: དེ་དག་ནི་འཁོར་བའི་ཐ་མ་གཞན་མེད་པའི་སྡུག་བསྔལ་ལས་ཐར་བར་འགྱུར་རོ།
en: They will be freed from the unavoidable sufferings of saṃsāra.

source: དེ་དག་ནི་གོས་དཀར་པོ་དང་སྐྱ་བོ་བཞིན་དུ་
en: Like white and pale yellow birds,

source: བྱ་ངང་པའི་རྒྱལ་པོ་མགྱོགས་པ་དང་རླུང་གི་ཤུགས་འོང་བ་བཞིན་དུ་བདེ་བ་ཅན་གྱི་འཇིག་རྟེན་གྱི་ཁམས་སུ་
en: like kings of geese moving with the speed of the wind, they will go to the realm of Sukhāvatī.

source: དེ་བཞིན་གཤེགས་པ་སྣང་བ་མཐའ་ཡས་ལས་ཆོས་མངོན་དུ་ཉན་པའི་ཕྱིར་འགྲོའོ་ཐོས་ནས་ཀྱང་
en: They will hear the Dharma by listening to Tathāgata Amitābha teach.

source: དེ་དག་གི་ལུས་ལ་འཁོར་བའི་སྡུག་བསྔལ་མི་འབྱུང་།
en: The sufferings of saṃsāra will not afflict their bodies.

source: འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་མི་འབྱུང་རྒ་བ་དང་། ཤི་བར་མི་འགྱུར།
en: They will not become old or die. They will have no desire, anger, or stupidity.

source: དེ་དག་གི་ལུས་ལ་བཀྲེས་པར་མི་འགྱུར། །
en: Their bodies will feel no hunger or thirst.

source: མངལ་ན་གནས་པའི་སྡུག་བསྔལ་བ་ཤེས་པར་མི་འགྱུར་ཏེ། །
en: They will not know the suffering of being inside a womb.

source: ཆོས་ཀྱི་རོས་བསྐྱོད་ནས་དེ་ཉིད་དུ་པད་མའི་ནང་དུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: Completely inspired by the taste of the Dharma, they will be reborn within a lotus

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡིད་དམ་བརྟན་པོ་ཡོངས་སུ་རྫོགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཐར་པ་ལ་གཞོག་གི་བར་དུ། འཇིག་རྟེན་གྱི་ཁམས་དེ་ན་རྟག་ཏུ་འཛིན་ཅིང་གནས་སོ། །
en: and will remain in that realm until Bodhisattva Mahāsattva Avalokiteśvara’s powerful commitment is fulfilled and all beings have been brought to liberation.’

source: བཅོམ་ལྡན་འདས་གང་གི་དུས་ན་ཡིད་དམ་བརྟན་པ་དེ་ཡོངས་སུ་རྫོགས་པ་ལགས།
en: ‘Bhagavat, when will that powerful commitment be fulfilled?’

source: སེམས་ཅན་མང་པོ་འཁོར་བ་ན་འཁོར་བའི་སེམས་ཅན་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་།
en: ‘He completely ripens the many beings who circle in saṃsāra,

source: བྱང་ཆུབ་ཀྱི་ལམ་སྟོན་པར་བྱེད་ཅིང་། གང་དང་གང་གི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་དུལ་བར་འགྱུར་བ་དེ་དང་དེའི་གཟུགས་ཀྱིས་ཆོས་འཆད་དེ།
en: teaches them the path to enlightenment, and teaches the Dharma in whatever form a being can be taught through.

source: དེ་བཞིན་གཤེགས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱིས་ཆོས་འཆད་
en: He teaches the Dharma in the form of a tathāgata to beings who are to be taught by a tathāgata.

source: རང་སངས་རྒྱས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི། རང་སངས་རྒྱས་ཀྱི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of a pratyekabuddha to beings who are to be taught by a pratyekabuddha.

source: དགྲ་བཅོམ་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་དགྲ་བཅོམ་པའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of an arhat to beings who are to be taught by an arhat.

source: བྱང་ཆུབ་སེམས་དཔས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའི་གཟུགས་ཀྱིས་ཆོས་འཆད། །
en: He teaches the Dharma in the form of a bodhisattva to beings who are to be taught by a bodhisattva.

source: དབང་ཕྱུག་ཆེན་པོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་དབང་ཕྱུག་ཆེན་པོའི་གཟུགས་ཀྱིས་ཆོས་འཆད། །
en: He teaches the Dharma in the form of Maheśvara to beings who are to be taught by Maheśvara.

source: མཐུ་བོ་ཆེས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་མཐུ་བོ་ཆེའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Nārāyaṇa to beings who are to be taught by Nārāyaṇa.

source: ཚངས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཚངས་པའི་གཟུགས་ཀྱིས་ཆོས་འཆད། །
en: He teaches the Dharma in the form of Brahmā to beings who are to be taught by Brahmā.

source: དབང་པོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི། དབང་པོའི་གཟུགས་ཀྱིས་ཆོས་འཆད། །
en: He teaches the Dharma in the form of Śakra to beings who are to be taught by Śakra.

source: ཉི་མས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཉི་མའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Āditya to beings who are to be taught by Āditya.

source: ཟླ་བས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཟླ་བའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Candra to beings who are to be taught by Candra.

source: མེ་ལྷས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་མེ་ལྷའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Agni to beings who are to be taught by Agni.

source: ཆུ་ལྷའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཆུ་ལྷའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Varuṇa to beings who are to be taught by Varuṇa.

source: རླུང་གི་ལྷའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་རླུང་ལྷའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Vāyu to beings who are to be taught by Vāyu.

source: ཀླུས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཀླུའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of a nāga to beings who are to be taught by a nāga.

source: བགེགས་མེད་པའི་བདག་པོས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི། བགེགས་མེད་པའི་བདག་པོའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Vighnapati to beings who are to be taught by Vighnapati.

source: གནོད་སྦྱིན་གྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་གནོད་སྦྱིན་གྱི་གཟུགས་ཀྱིས་ཆོས་འཆད་
en: He teaches the Dharma in the form of a yakṣa to beings who are to be taught by a yakṣa.

source: ངལ་བསོ་པོའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ངལ་བསོ་པོའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of Vaiśravaṇa to beings who are to be taught by Vaiśravaṇa.

source: རྒྱལ་པོའི་གཟུགས་ཀྱིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་རྒྱལ་པོའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of a king to beings who are to be taught by a king.

source: མཁས་པས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི། མཁས་པའི་གཟུགས་ཀྱིས་ཆོས་འཆད།
en: He teaches the Dharma in the form of a paṇḍita to beings who are to be taught by a paṇḍita.

source: རྒྱལ་པོའི་མིས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི། རྒྱལ་པོའི་མིའི་གཟུགས་ཀྱིས་ཆོས་འཆད། །
en: He teaches the Dharma in the form of a king’s soldier to beings who are to be taught by a king’s soldier.

source: ཕ་དང་མས་འདུལ་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཕ་དང་མའི་གཟུགས་ཀྱིས་ཆོས་འཆད་དེ། །
en: He teaches the Dharma in the form of parents to beings who are to be taught by their parents.

source: སེམས་ཅན་དག་ཇི་ལྟ་ཇི་ལྟར་འདུལ་བ། དེ་ལྟ་དེ་ལྟར་ཆོས་སྟོན་ཏོ།
en: He teaches the Dharma in whatever particular form a being should be taught through.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ནི་དེ་ལྟར་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ཅིང་མྱ་ངན་ལས་འདས་པའི་ཆོས་སྟོན་ཏོ།
en: That, noble son, is how Bodhisattva Mahāsattva Avalokiteśvara completely ripens beings and teaches them the Dharma of nirvāṇa.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: “Then Bodhisattva Ratnapāṇi said to Bhagavat Śikhin,

source: བཅོམ་ལྡན་འདས་བདག་ནི་ཤིན་ཏུ་ངོ་མཚར་ཐོབ་པར་གྱུར་ཏེ།
en: ‘Bhagavat, this is extraordinarily marvelous.

source: བདག་ནི་ནམ་ཡང་འདི་འདྲ་བའི་ཡུལ་མཐོང་བའམ། ཐོས་པར་མ་གྱུར་ཏེ།
en: I have never seen nor heard of such a thing before.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡུལ་ཇི་ལྟ་བ་དེ་འདྲ་བ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ་ཡང་མ་མཆིས་སོ། །
en: Not even the tathāgatas have what Bodhisattva Mahāsattva Avalokiteśvara has.’

source: རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ཉིད་ན་རྡོ་རྗེའི་མངལ་ཞེས་བྱ་བའི་ཕུག་ཡོད་པ་དེ་ན་ལྷ་མ་ཡིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མ་གནས་ཏེ། །
en: ‘Noble son, in this Jambudvīpa there is a cave named Vajrakukṣi in which a hundred thousand million times ten million asuras live.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལྷ་མ་ཡིན་རྣམས་ལ་ལྷ་མ་ཡིན་གྱི་གཟུགས་ཀྱིས་ཆོས་འཆད་དེ། །
en: Bodhisattva Mahāsattva Avalokiteśvara teaches the asuras there in the form of an asura.

source: ཐེག་པ་ཆེན་པོའི་མདོ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་འདི་ཉིད་འཆད་དོ། །
en: He teaches them the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: ཁྱེད་ཅག་ཉོན་ཅིག
en: “You must listen.”

source: གང་ལྷ་མ་ཡིན་གཞན་པ་དེ་དག་ཀྱང་བྱམས་པའི་སེམས་དང་ཞི་བའི་སེམས་སུ་བྱས་ཤིང་། །
en: “ ‘Then all other asuras, with loving minds and peaceful minds,

source: ལག་པའི་ཐལ་མོ་སྦྱར་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་ལ་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཉིད་ཉན་ཏོ། །
en: with palms placed together, come to listen to this Dharma teaching from Bodhisattva Mahāsattva Avalokiteśvara:

source: གང་འཇིག་རྟེན་ན་མདོ་སྡེའི་རྒྱལ་པོ་འདི་ལྟ་བུ་མངོན་དུ་བྱེད་པ་དེ་དག་ནི་བདེ་བ་དང་ལྡན་པ་ཡིན་ནོ།
en: “ ‘ “Those who turn their minds to this king of the sūtras will have happiness in this world.

source: ཐོས་ནས་ཀྱང་མཚམས་མེད་པ་ལྔ་དག་ཟད་པར་བྱེད་དོ། །
en: Hearing it will purify them of the five actions with immediate results on death.

source: འཆི་བའི་ཚེ་ཡང་དེ་བཞིན་གཤེགས་པ་བཅུ་གཉིས་གཤེགས་ནས་
en: At the time of death, twelve tathāgatas will come and

source: རིགས་ཀྱི་བུ་མ་འཇིགས་ཤིག །
en: ‘Noble son, do not be afraid.

source: ཁྱོད་ཀྱིས་ཐེག་པ་ཆེན་པོའི་མདོ་སྡེའི་རྒྱལ་པོ་ཟ་མ་ཏོག་བཀོད་པ་ཐོས་སོ། །
en: You have heard the precious king of the Mahāyāna sūtras, The Sūtra of the Basket’s Display

source: བདེ་བ་ཅན་དུ་འགྲོ་བའི་ཕྱིར་ལམ་སྣ་ཚོགས་ཀྱང་། སྟ་གོན་བྱས་སོ། །
en: You have prepared various paths for going to Sukhāvatī.

source: གདུགས་སྣ་ཚོགས་དང་། ཅོད་པན་དང་། རྣ་ཆ་དང་། སེ་མོ་དོ་རྣམས་ཀྱང་སྟ་གོན་བྱས་སོ་
en: You have prepared various parasols, various crowns, various earrings, and various necklaces.’

source: ལྟས་དེ་ལྟ་བུ་འབྱུང་ཞིང་འཆི་བའི་དུས་ཀྱི་ཚེ། བར་ཆད་མེད་པར་བདེ་བ་ཅན་དུ་འགྲོ་བར་འགྱུར་རོ།
en: When that kind of omen appears, at death they will go without impediment to Sukhāvatī.”

source: ལག་ན་རིན་པོ་ཆེ། དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་དེ་ནི་ལྷ་མ་ཡིན་རྣམས་ལ་མྱ་ངན་ལས་འདའ་བའི་ཆོས་སྟོན་པར་བྱེད། སྒོ་སྟོན་པར་བྱེད་དོ། །
en: “ ‘Ratnapāṇi, in that way, Bodhisattva Mahāsattva Avalokiteśvara teaches the Dharma of nirvāṇa to the asuras and shows them the entranceway to nirvāṇa.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་པོ་ཆེས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་དེ་ཉིད་ནས་སོང་ངོ་། །
en: “Then Bodhisattva Ratnapāṇi bowed his head to Bhagavat Śikhin’s feet and departed.”

source: དེ་ཡང་འདས་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་རྐང་པར་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ་བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཐམས་ཅད་སྐྱོབ་པ་ཞེས་བྱ་བ་སྔོན་བྱུང་བར་གྱུར་ཏོ།
en: “In a later time, there was the Tathāgata, the arhat, the samyaksaṃbuddha, perfect in wisdom and conduct, the sugata, the knower of the world, the unsurpassable guide who tamed beings, the teacher of devas and humans, the buddha, the Bhagavat Viśvabhū.

source: དེའི་ཚེ་དེའི་དུས་ན་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་ང་ནི་མི་མི་རྒྱུ་བའི་སའི་ཕྱོགས་རི་ཁྲོད་ཀྱི་བར་རི་བྲགས་ཤིག་ན་གནས་ཤིང་བཟོད་པ་སྨྲ་བར་གྱུར་ཏེ། །
en: “At that time, Sarva­nīvaraṇa­viṣkambhin, I was a rishi who taught patience and lived in a cliff among the mountains where people did not go.

source: དེའི་ཚེ་དེའི་དུས་སུ་ངས་དེ་བཞིན་གཤེགས་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་ཡོན་ཏན་བརྗོད་པ་ཐོས་ཏེ། འདི་ལྟ་སྟེ། །
en: At that time, I heard Tathāgata Viśvabhū describe the qualities of Bodhisattva Mahāsattva Avalokiteśvara.

source: གསེར་གྱི་ས་ལ་སོང་ནས་སེམས་ཅན་སྤྱིའུ་ཚུགས་སུ་འདུག་པ་རྣམས་ལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་ལམ་མྱ་ངན་ལས་འདའ་བ་སྟོན་པར་བྱེད་པ་དང་ལྡན་པའི་ཆོས་སྟོན་ཏོ།
en: “Avalokiteśvara had gone to the land of gold and taught the eightfold noble path, the Dharma that teaches nirvāṇa, to the upside-down beings who lived there.

source: དེ་ནས་གསེར་གྱི་ས་ལས་བྱུང་སྟེ།
en: “He then left the land of gold

source: དངུལ་གྱི་ས་ལ་སོང་ནས།
en: and went to the land of silver.

source: དེ་ན་སྐྱེས་བུ་གང་ཟག་རྐང་པ་བཞི་ཡོད་པ་དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོ་
en: Bodhisattva Mahāsattva Avalokiteśvara said to the four-legged beings who lived there,

source: ཁྱེད་ཅག་བསམ་པ་དམ་པ་རབ་ཀྱིས་མྱ་ངན་ལས་འདའ་བའི་རྒྱགས་ཀྱི་རྗེས་སུ་སེམས་ཤིང་མངོན་དུ་ཕྱོགས་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཉོན་ཅིག་ཅེས་ཆོས་འཆད་དོ། །
en: ‘You must listen with perfect, pure thought to this Dharma teaching on contemplating nirvāṇa, on turning the mind to nirvāṇa.’ Then Avalokiteśvara taught them the Dharma.

source: དེ་ནས་སྐྱེས་བུ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མདུན་དུ་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: “Those beings sat before Bodhisattva Mahāsattva Avalokiteśvara and requested him,

source: དེ་ནས་སྐྱེས་བུ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་པོའི་མདུན་དུ་འདུག་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: “Those beings sat before Bodhisattva Mahāsattva Avalokiteśvara and requested him,

source: སེམས་ཅན་ལོང་བ་རྣམས་ལ་ནི་ལམ་སྟོན་ཅིག་
en: ‘Show the path to blind beings!

source: མགོན་མ་མཆིས་པ་རྣམས་ལ་ནི་མགོན་དང་སྐྱབས་མཛོད་ཅིག །
en: Be a protector and refuge to beings who have no protector!

source: ཕ་དང་མ་མ་མཆིས་པ་རྣམས་ལ་ནི་ཕ་དང་མར་མཛོད་ཅིག །
en: Be a father and mother to those who do not have a father and mother!

source: ངན་སོང་གསུམ་གྱི་མུན་པ་ལ་ནི་སྒྲོན་མེ་མཛོད་ཅིག །
en: Be a lamp for the darkness of the three lower existences!

source: ཚོར་བར་བགྱིད་པའི་ཐར་པའི་ལམ་སྟོན་ཅིག །
en: Be aware of us and show us, with great compassion, the path to liberation.
